Revit 2027 API
CoordinationModelLinkUtils.SetTransparencyOverride Method
 Sets the transparency override value for the provided Coordination Model type.
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void SetTransparencyOverride(
	Document document,
	View view,
	Element coordinationModelType,
	int transparency
)
Public Shared Sub SetTransparencyOverride (
	document As Document,
	view As View,
	coordinationModelType As Element,
	transparency As Integer
)
public:
static void SetTransparencyOverride(
	Document^ document,
	View^ view,
	Element^ coordinationModelType,
	int transparency
)
static member SetTransparencyOverride :
        document : Document *
        view : View *
        coordinationModelType : Element *
        transparency : int -> unit
Parameters
document Document
 The document.
view View
 The view.
coordinationModelType Element
 The Coordination Model type element.
transparency Int32
 The transparency value to apply (in percentage). A 0-value transparency means no override is set.
Exceptions
Exception | Condition
ArgumentException |  document is not a project document. -or- The element coordinationModelType was not found in the given document. -or- The provided element is not a Coordination Model type.
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  The value is invalid. The valid range is 0 through 100
InvalidOperationException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements).
ModificationForbiddenException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process.
ModificationOutsideTransactionException |  The document has no open transaction.
Remarks
 Transparency must be greater than 0 and less than 100 (0 = opaque, 100 = fully transparent).
 By default, the transparency setting has no override and its value is 0.
See Also
Reference
CoordinationModelLinkUtils Class
Autodesk.Revit.DB.ExternalData Namespace